Rahix/avr-device/vendor/atmega8u2.atdf
        <module name="BOOT_LOAD">
          <instance name="BOOT_LOAD" caption="Bootloader">
            <register-group name="BOOT_LOAD" name-in-module="BOOT_LOAD" offset="0x00" address-space="data" caption="Bootloader"/>
          </instance>
        </module>
        <module name="EEPROM">
          <instance name="EEPROM" caption="EEPROM">
            <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data" caption="EEPROM"/>
          </instance>
        </module>
        <module name="TC8">
          <instance name="TC0" caption="Timer/Counter, 8-bit">
            <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data" caption="Timer/Counter, 8-bit"/>
            <signals>
              <signal group="OCA" pad="PB7" function="default"/>
              <signal group="OCB" pad="PD0" function="default"/>
              <signal group="T" pad="PD7" function="default"/>
            </signals>
          </instance>
        </module>
        <module name="TC16">
          <instance name="TC1" caption="Timer/Counter, 16-bit">
            <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
            <signals>
              <signal group="ICP" pad="PC7" function="default"/>
              <signal group="OCA" pad="PC6" function="default"/>
              <signal group="OCB" pad="PC5" function="default"/>
              <signal group="OCC" pad="PB7" function="default"/>
              <signal group="T" pad="PB4" function="default"/>
            </signals>
          </instance>
        </module>
        <module name="PLL">
          <instance name="PLL" caption="Phase Locked Loop">
            <register-group name="PLL" name-in-module="PLL" offset="0x00" address-space="data" caption="Phase Locked Loop"/>
          </instance>
        </module>
        <module name="USB_DEVICE">
          <instance name="USB_DEVICE" caption="USB Device Registers">
            <register-group name="USB_DEVICE" name-in-module="USB_DEVICE" offset="0x00" address-space="data" caption="USB Device Registers"/>
          </instance>
        </module>
        <module name="CPU">
          <instance name="CPU" caption="CPU Registers">
            <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data" caption="CPU Registers"/>
            <parameters>
              <param name="CORE_VERSION" value="V3"/>
            </parameters>
          </instance>
        </module>
        <module name="EXINT">
          <instance name="EXINT" caption="External Interrupts">
            <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data" caption="External Interrupts"/>
            <signals>
              <signal group="INT" index="0" pad="PD0" function="default"/>
              <signal group="INT" index="1" pad="PD1" function="default"/>
              <signal group="INT" index="2" pad="PD2" function="default"/>
              <signal group="INT" index="3" pad="PD3" function="default"/>
              <signal group="INT" index="4" pad="PC7" function="default"/>
              <signal group="INT" index="5" pad="PD4" function="default"/>
              <signal group="INT" index="6" pad="PD6" function="default"/>
              <signal group="INT" index="7" pad="PD7" function="default"/>
              <signal group="PCINT" index="0" pad="PB0" function="default"/>
              <signal group="PCINT" index="1" pad="PB1" function="default"/>
              <signal group="PCINT" index="2" pad="PB2" function="default"/>
              <signal group="PCINT" index="3" pad="PB3" function="default"/>
              <signal group="PCINT" index="4" pad="PB4" function="default"/>
              <signal group="PCINT" index="5" pad="PB5" function="default"/>
              <signal group="PCINT" index="6" pad="PB6" function="default"/>
              <signal group="PCINT" index="7" pad="PB7" function="default"/>
              <signal group="PCINT" index="8" pad="PC6" function="default"/>
              <signal group="PCINT" index="9" pad="PC5" function="default"/>
              <signal group="PCINT" index="10" pad="PC4" function="default"/>
              <signal group="PCINT" index="11" pad="PC2" function="default"/>
              <signal group="PCINT" index="12" pad="PD5" function="default"/>
            </signals>
          </instance>
        </module>
        <module name="USART">
          <instance name="USART1" caption="USART">
            <register-group name="USART1" name-in-module="USART1" offset="0x00" address-space="data" caption="USART"/>
            <signals>
              <signal group="RXD" pad="PD2" function="default"/>
              <signal group="TXD" pad="PD3" function="default"/>
              <signal group="XCK" pad="PD5" function="default"/>
              <signal group="RTS" pad="PD6" function="default"/>
              <signal group="CTS" pad="PD7" function="default"/>
            </signals>
          </instance>
        </module>
        <module name="WDT">
          <instance name="WDT" caption="Watchdog Timer">
            <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data" caption="Watchdog Timer"/>
          </instance>
        </module>
        <module name="AC">
          <instance name="AC" caption="Analog Comparator">
            <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data" caption="Analog Comparator"/>
            <signals>
              <signal group="AIN" index="0" pad="PD1" function="default"/>
              <signal group="AIN" index="1" pad="PD2" function="default"/>
              <signal group="AIN" index="2" pad="PC2" function="default"/>
              <signal group="AIN" index="3" pad="PD4" function="default"/>
              <signal group="AIN" index="4" pad="PD5" function="default"/>
              <signal group="AIN" index="5" pad="PD6" function="default"/>
              <signal group="AIN" index="6" pad="PD7" function="default"/>
            </signals>
          </instance>
        </module>
        <module name="FUSE">
          <instance name="FUSE" caption="Fuses">
            <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses" caption="Fuses"/>
